[
    {
        "char_id": 1,
        "name": "Ragnar",
        "img": "https://cropper.watch.aetnd.com/cdn.watch.aetnd.com/sites/2/2016/10/vikings_season4_cast_ragnar_16_9.jpg?w=548",
        "played_by": "Played by Travis Fimmel",
        "details": "Ragnar Lothbrok is a restless warrior and family man who longs to find and explore new countries across the sea. His goal is to settle his own people to thrive on rich new farm lands. Now that he is King, his ambition to raid new kingdoms remains unquenchable, not least because he claims to be an ancestor of the Norse god Odin–the god of slain warriors, but also the god of eternal curiosity."
    },
    {
        "char_id": 2,
        "name": "Lagertha",
        "img": "https://cropper.watch.aetnd.com/cdn.watch.aetnd.com/sites/2/2016/10/vikings_season4_cast_lagertha.jpg?w=548",
        "played_by": "Played by Katheryn Winnick",
        "details": "Lagertha is the first wife of Ragnar Lothbrok. She is an Earl, a strong shield-maiden and a force to be reckoned with. She has always fought in the shield-wall alongside the men. Although fate has pulled her apart from Ragnar, it seems that the gods must have a plan to bring them back together, where they belong."
    },
    {
        "char_id": 3,
        "name": "Aethelwulf",
        "img": "https://cropper.watch.aetnd.com/cdn.watch.aetnd.com/sites/2/2016/10/vikings_season4_cast_aethelwulf.jpg?w=548",
        "played_by": "Played by Moe Dunford",
        "details": "Son of King Ecbert, Aethelwulf doesn’t understand his father’s interest in Ragnar and the pagan Northmen, but as a faithful son he will do whatever his father asks. Ecbert is grooming him to become king and continue his lineage."
    },
    {
        "char_id": 4,
        "name": "Astrid",
        "img": "https://cropper.watch.aetnd.com/cdn.watch.aetnd.com/sites/2/2016/11/vikings_4b_cast_astrid.jpg?w=548",
        "played_by": "Played by Josefin Asplund",
        "details": "Astrid is a beautiful young woman who has joined Lagertha’s court at Hedeby. She is a free spirit who refuses to accept social conventions or recognize any barriers to her freedom: she is on a voyage of self-discovery. Lagertha will train Astrid in the arts of war, and the arts of love."
    },
    {
        "char_id": 5,
        "name": "Bjorn",
        "img": "https://cropper.watch.aetnd.com/cdn.watch.aetnd.com/sites/2/2016/10/vikings_season4_cast_bjorn.jpg?w=548",
        "played_by": "Played by Alexander Ludwig",
        "details": "Bjorn Lothbrok is the son of Ragnar and Lagertha and the oldest of Ragnar’s many sons. Intelligent and determined, Bjorn loves and admires his father above all men. Following in Ragnar’s footsteps, Bjorn desires to test himself as a fighter as well as an explorer. After fighting in battle without receiving one wound or scratch, he garnered the famous nickname “Bjorn Ironside.”"
    },
    {
        "char_id": 6,
        "name": "Emperor Charles",
        "img": "https://cropper.watch.aetnd.com/cdn.watch.aetnd.com/sites/2/2016/10/vikings_season4_cast_charles.jpg?w=548",
        "played_by": "Played by Lothaire Bluteau",
        "details": "Emperor Charles is a complex, troubled man, who has taken full credit for the defeat of the Vikings, although he hid in cowardice during the battle."
    },
    {
        "char_id": 7,
        "name": "Floki",
        "img": "https://cropper.watch.aetnd.com/cdn.watch.aetnd.com/sites/2/2016/10/vikings_season4_cast_floki.jpg?w=548",
        "played_by": "Played by Gustaf Skarsgård",
        "details": "Floki is a genius ship builder and he designs and builds the prototype of the new generation of Viking ships which can sail across the open ocean but also up the shallowest of rivers. Without Floki, Ragnar would have never been able to fulfill his dreams of discovering new lands and new civilizations. Floki is a religious zealot who believes in the Gods above anything and everything, including Ragnar."
    },
    {
        "char_id": 8,
        "name": "Halfdan the Black",
        "img": "https://cropper.watch.aetnd.com/cdn.watch.aetnd.com/sites/2/2016/10/vikings_season4_cast_halfdan.jpg?w=548",
        "played_by": "Played by Jasper Pääkkönen",
        "details": "King Harald’s violent, devoutly loyal younger brother."
    },
    {
        "char_id": 9,
        "name": "Hvitserk",
        "img": "https://cropper.watch.aetnd.com/cdn.watch.aetnd.com/sites/2/2016/11/vikings_4b_cast_hvitserk.jpg?w=548",
        "played_by": "Played by Marco Ilsø",
        "details": "Son of Ragnar. Hvitserk and his older brother Ubbe have a special bond because when they were children they jumped together in an icy lake and had to be rescued by Siggy, who died in the attempt. Hvitserk is more complex and a darker character than his brother Ubbe, characteristics which become more pronounced in time and lead to a terrible denouement."
    },
    {
        "char_id": 10,
        "name": "Ivar the Boneless",
        "img": "https://cropper.watch.aetnd.com/cdn.watch.aetnd.com/sites/2/2016/11/vikings_4b_cast_ivar.jpg?w=548",
        "played_by": "Played by Alex Høgh Andersen",
        "details": "Son of Ragnar. Perhaps the most famous Viking of all time, his pathological cruelty was notorious even during his own lifetime. Ivar is deeply ambitious and his ambitions will twist the legacy of his father out of shape, and create universal war. People are genuinely afraid of Ivar."
    },
    {
        "char_id": 11,
        "name": "Judith",
        "img": "https://cropper.watch.aetnd.com/cdn.watch.aetnd.com/sites/2/2016/10/vikings_season4_cast_judith.jpg?w=548",
        "played_by": "Played by Jennie Jacques",
        "details": "Judith is the daughter of King Aelle and wife to Aethelwulf. Her infatuation with Athelstan became her downfall, and their affair led to the birth of the child Alfred, who King Ecbert believes to be a child of God. Judith and her son survived through the protection of King Ecbert, but his protection comes with a price."
    },
    {
        "char_id": 12,
        "name": "King Ecbert",
        "img": "https://cropper.watch.aetnd.com/cdn.watch.aetnd.com/sites/2/2016/10/vikings_s3_ecbert.jpg?w=548",
        "played_by": "Played by Linus Roache",
        "details": "King Ecbert is the ruler of Wessex, the largest of the five kingdoms in England with big plans to make it even larger. Ecbert is a sophisticated visionary, well versed in court life. Ecbert has always anticipated that he must someday face the Vikings and is prepared with strategies as to how they can be used to his advantage."
    },
    {
        "char_id": 13,
        "name": "King Harald Finehair",
        "img": "https://cropper.watch.aetnd.com/cdn.watch.aetnd.com/sites/2/2016/10/vikings_season4_cast_harald.jpg?w=548",
        "played_by": "Played by Peter Franzén",
        "details": "A complex character who seeks to be King of Norway and is a potential threat to Ragnar."
    },
    {
        "char_id": 14,
        "name": "Princess Gisla",
        "img": "https://cropper.watch.aetnd.com/cdn.watch.aetnd.com/sites/2/2016/10/vikings_season4_cast_gisla_.jpg?w=548",
        "played_by": "Played by Morgane Polanski",
        "details": "The daughter of Emperor Charles and a beautiful, young woman of considerable courage and resolution. However, she is still a woman and therefore remains at the mercy of the powerful and calculating men around her. Much to her dismay, she is forced into an arranged marriage with Rollo, the new Duke of Normandy."
    },
    {
        "char_id": 15,
        "name": "Queen Aslaug",
        "img": "https://cropper.watch.aetnd.com/cdn.watch.aetnd.com/sites/2/2016/10/vikings_season4_cast_aslaug_16_9.jpg?w=548",
        "played_by": "Played by Alyssa Sutherland",
        "details": "Aslaug is the clever and beautiful daughter of the famed dragon slayer Sigurd and shield-maiden Brunhilde. Aslaug promised Ragnar that she would provide him with the sons which the ancient Seer prophesized for him–and she delivered."
    },
    {
        "char_id": 16,
        "name": "Rollo",
        "img": "https://cropper.watch.aetnd.com/cdn.watch.aetnd.com/sites/2/2016/10/vikings_season4_cast_rollo.jpg?w=548",
        "played_by": "Played by Clive Standen",
        "details": "Rollo, Ragnar’s brother, is impulsive, wild, care-free and compulsive. Rollo is a fierce fighter who is often overshadowed by his brother. The relationship between Rollo and Ragnar is intense and always unpredictable. Rollo has become the Duke of Normandy after marrying Princess Gisla (the daughter of Emperor Charles) and is named defender of France from the Vikings."
    },
    {
        "char_id": 17,
        "name": "Sigurd Snake in the Eye",
        "img": "https://cropper.watch.aetnd.com/cdn.watch.aetnd.com/sites/2/2016/11/vikings_4b_cast_sigurd.jpg?w=548",
        "played_by": "Played by David Lindström",
        "details": "Son of Ragnar. Sigurd was born with astigmatism in one eye, in the shape of a snake or dragon. This flaw has a damaging psychological impact on him, making him feel different from his older brothers and more estranged from the family. He is a sensitive young man, growing up feeling that he has to provide himself."
    },
    {
        "char_id": 18,
        "name": "Ubbe",
        "img": "https://cropper.watch.aetnd.com/cdn.watch.aetnd.com/sites/2/2016/11/vikings_4b_cast_ubbe.jpg?w=548",
        "played_by": "Played by Jordan Patrick Smith",
        "details": "The oldest son by Ragnar and Aslaug, he has a paternalistic attitude towards his younger brothers. Ubbe is a sensitive, thoughtful and attractive young man, in many ways the closest in outlook and instinct to his father Ragnar."
    },
    {
        "char_id": 19,
        "name": "The Seer",
        "img": "https://cropper.watch.aetnd.com/cdn.watch.aetnd.com/sites/2/2016/10/vikings_season4_cast_seer.jpg?w=548",
        "played_by": "Played by John Kavanagh",
        "details": "The ancient seer is one of the most important figures in Viking life because the Vikings believe in fate and the Seers can read the runes and often translate the wishes of the gods."
    }
]